app/controllers/students_controller.rb

def show
  @student = Student.find(params[:first_name, :last_name])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]